[
    ["15-1", "Hex Nut", "A fastener with a hexagonal shape and internal threads, designed to be tightened or loosened using a wrench. It's the most common type of nut due to its versatility and ease of use."],
    ["15-2", "Lock Nut", "A nut designed with a mechanism to prevent loosening under vibration or rotation. Types include nylon-insert (with a non-metallic insert), deformed thread (slightly oval shape), and all-metal (with a distorted top flange)."],
    ["15-3", "Wing Nut", "A nut with two flat projections (wings) perpendicular to its axis, allowing for hand tightening without tools. Ideal for applications requiring frequent adjustment or removal."],
    ["15-4", "Cap Nut (Acorn Nut)", "A decorative nut with a domed, closed end that covers the bolt thread. It provides a finished appearance and protects against corrosion and injury from exposed threads."],
    ["15-5", "Flange Nut", "A nut with an integrated, wide flange at its base that serves as a built-in washer. It distributes load over a larger area and can reduce assembly time by eliminating the need for a separate washer."],
    ["15-6", "Castle Nut", "A nut with slots cut into one end, designed to be used with a cotter pin or safety wire. It provides a secure, locking connection in applications where loosening could be catastrophic."],
    ["15-7", "T-Nut", "A nut with a long, thin body and a flange with sharp prongs. It's designed to be embedded in wood or soft materials, with the prongs preventing rotation when a bolt is tightened."],
    ["15-8", "Cage Nut", "A nut encased in a spring steel cage, allowing it to float and self-align. Commonly used in rack mounting systems where precise alignment might be difficult."],
    ["15-9", "Coupling Nut", "A cylindrical nut with internal threads running its entire length, used to join two threaded rods or bolts end-to-end. Also known as a connecting nut or extension nut."],
    ["15-10", "Jam Nut", "A thin nut, typically half the height of a standard nut, used in pairs to lock a threaded fastener in place. The two nuts are tightened against each other to prevent loosening."],
    ["15-21", "K-Lock Nut", "A self-locking nut featuring a deformed thread at the top portion. The \"K\" refers to the shape of the deformed thread when viewed in cross-section. It provides resistance to vibration and loosening without the need for additional locking devices."],
    ["15-22", "Square Nut", "A nut with a square external shape and internal threads. It's designed for use in applications where a hex nut might rotate, such as in slotted holes or channels. The flat sides provide more surface area contact, increasing resistance to turning."],
    ["15-11", "Flat Washer", "A thin, flat disk with a center hole, used to distribute the load of a threaded fastener. It provides a smooth bearing surface and protects the surface being fastened."],
    ["15-12", "Split Lock Washer", "A ring-shaped washer with a cut at one point and twisted so that each side of the cut is on a different plane. It exerts pressure when compressed, resisting loosening due to vibration."],
    ["15-13", "Belleville Washer", "A slightly conical spring washer that, when compressed, provides tension in the fastened joint. It's used for applications requiring high load capacity in a small space."],
    ["15-14", "Fender Washer", "A flat washer with an unusually large outside diameter in proportion to its center hole. It's used to distribute load over a larger area, particularly with soft or thin materials."],
    ["15-15", "Wave Washer", "A washer with a wavy profile that acts like a spring when compressed. It's used to accommodate thermal expansion, maintain tension, or take up play in assemblies."],
    ["15-16", "Tooth Lock Washer", "A washer with serrations or teeth on its inner or outer edge (or both). These teeth bite into the bearing surface, preventing rotation and loosening of the fastener."],
    ["15-17", "Square Washer", "A flat, square-shaped washer with a center hole. It provides a larger bearing surface than round washers and is often used in wood construction or with U-bolts."],
    ["15-18", "Shoulder Washer", "A washer with a cylindrical shoulder or sleeve extending from one side. It's used to insulate screws electrically, maintain spacing, or act as a bushing in assemblies."],
    ["15-19", "Countersunk Washer", "A washer with a tapered edge designed to match the angle of a countersunk screw head. It allows the screw to sit flush with or below the surface of the material."],
    ["15-20", "Nord-Lock Washer", "A pair of washers with radial teeth on one side and a cam surface on the other. When tightened, the cams rise up, creating a wedge effect that prevents loosening even under extreme vibration."]
]