[
    ["2-1", "Sheet metal screw", "A type of self-tapping screw with a sharp point and threads designed to fasten sheet metal to wood or metal substrates. It is commonly used in HVAC systems, metal roofing, and automotive applications."],
    ["2-2", "Machine screw", "A type of screw with a uniform diameter and threads that is designed to be used with a nut or tapped hole. It is commonly used in machinery, appliances, and electronic devices for assembly and fastening applications."],
    ["2-28", "Hex head screw", "A screw with a hexagonal head designed for use with a wrench or socket for fastening materials together. It is commonly used in construction, automotive, and industrial applications for secure and reliable fastenings."],
    ["2-3", "Wood screw", "A screw designed for fastening wood to wood or other materials. It has a tapered point and coarse threads to provide a strong grip in wood substrates. Wood screws are commonly used in furniture assembly, carpentry, and construction."],
    ["2-4", "Drywall screw", "A type of self-tapping screw with a bugle head and fine threads designed for fastening drywall to wood or metal studs. Drywall screws are commonly used in interior construction and remodeling projects."],
    ["2-7", "Deck screw", "A type of screw designed for fastening decking materials to wood or metal framing. It features a corrosion-resistant coating and special threads for secure attachment in outdoor environments. Deck screws are commonly used in deck construction and outdoor projects."],
    ["2-10", "Socket screw", "A screw with a cylindrical head and internal hexagonal drive socket. It is commonly used in machinery, automotive, and industrial applications for high-torque fastening and assembly."],
    ["2-11", "Set screw", "A screw used to secure an object within or against another object. It typically has no head and is threaded along the entire length. Set screws are commonly used in machinery, automotive, and construction applications for alignment and locking purposes."],
    ["2-12", "Shoulder screw", "A screw with a cylindrical shoulder between the head and the threads. It is commonly used in machinery, tooling, and automotive applications for precise spacing and alignment requirements."],
    ["2-13", "Thread-cutting & Thread-forming screw", "A screw designed to cut (or form) its own threads in a pre-drilled hole. It is commonly used in metal, plastic, and wood applications for creating strong and secure fastenings without the need for tapping threads."],
    ["2-15", "Thumb screw", "A screw with a large head and knurled edges for hand-tightening without the need for tools. It is commonly used in applications where frequent adjustments or removals are required, such as machinery, fixtures, and equipment."],
    ["2-16", "Weld screw", "A screw designed for welding to metal surfaces for permanent fastening. It features a threaded shank and a flat or flanged head for secure attachment in welding applications. Weld screws are commonly used in automotive, construction, and industrial projects."],
    ["2-17", "Drive screw", "A screw with a slotted or square drive head for fastening materials together. It is commonly used in woodworking, furniture assembly, and general construction applications for secure and reliable fastenings."],
    ["2-18", "Captivated screw", "A screw with a captive washer or retainer to prevent the screw from disengaging from the assembly. It is commonly used in electronics, automotive, and aerospace applications for secure and reliable fastenings in high-vibration environments."],
    ["2-19", "Tamper-resistant screw", "A screw designed to deter tampering or unauthorized removal by requiring a special tool or driver for installation and removal. It is commonly used in public facilities, security systems, and equipment where security is a concern."]
]